app/Controllers/Auth.php

    public function login()
    {
        $response = array();
        if ($this->request->getPost()) {
            $data = $this->request->getPost();
            if ($this->userModel->where(['user_name' => $data["user_name"], 'user_password' => $data["user_password"]])->first()) {
---
SELECT *
FROM `user`
WHERE `user_name` = 'test'
AND `user_password` = 'test123'
 LIMIT 1