app/Controllers/Menu.php

	public function index()
	{
		$totalMenu = count($this->menuModel->findAll()) + 1;
---
SELECT *
FROM `menu`

	public function getAll()
	{
		$response = $data['data'] = array();

		$result = $this->menuModel->select()->orderBy('menu_order', 'asc')->findAll();
---
SELECT *
FROM `menu`
ORDER BY `menu_order` ASC