app/Controllers/User.php

	public function getAll()
	{
		$response = $data['data'] = array();

		$result = $this->userModel->select()->findAll();
---
SELECT *
FROM `user`